tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "mongodb/brew"
# tap "vitorgalvao/tiny-scripts"
# tap "aquasecurity/trivy"
# tap "filosottile/gomod"
# tap "go-task/tap"
# tap "gobuffalo/tap"

mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
# mas "App Language Chooser", id: 451732904
# mas "CADReader", id: 1484905765
# mas "DevCleaner", id: 1388020431
# mas "Developer", id: 640199958
# mas "Discovery", id: 1381004916
# mas "Disk Speed Test", id: 425264550
# mas "eXtra Voice Recorder", id: 514587383
mas "Free Ruler", id: 1483172210
mas "HiddenMe", id: 467040476
#mas "LimeChat", id: 414030210
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "PDFify", id: 1435055351
# mas "QR Capture", id: 1369524274
# mas "Quick Ringtone Maker", id: 1341568374
mas "Recordia", id: 1529006487
mas "ScanCode", id: 1482517543
# mas "SerialTools", id: 611021963
# mas "Service Station", id: 1503136033
# mas "Sequel Ace", id: 1518036000 # mysql
mas "The Unarchiver", id: 425424353
# mas "Uni Detector", id: 1531249804
# mas "Vidrio", id: 1209843625
# mas "Wire", id: 931134707
mas "Xcode", id: 497799835


brew "ansible"
# brew "jpeg-xl"
# brew "aom"
# brew "atomicparsley"
# brew "automake"
brew "awscli"
# brew "caddy"
# brew "glib"
# brew "cairo"
brew "coreutils"
# brew "libtool"
# brew "nghttp2"
# brew "cask"
# brew "cmake"
# brew "pcre2"
# brew "composer"
# brew "croc"
# brew "dive"
# brew "dos2unix"
# brew "dsh"
# brew "duti"
brew "exa" # ls
# brew "harfbuzz"
brew "ffmpeg"
# brew "folly"
# brew "fswatch"
# brew "geos"
# brew "nspr"
# brew "nss"
# brew "numpy"
# brew "poppler-qt5"
# brew "gdal"
# brew "git-lfs"
brew "gnupg"
brew "go"
brew "hcloud"
# brew "hey"
# brew "hledger"
# brew "htmlq"
# brew "htop"
# brew "libheif"
# brew "imagemagick"
# brew "jasper"
brew "jq"
# brew "kompose"
brew "lesspipe"
# brew "lftp"
brew "mas"
brew "maven"
# brew "mkcert"
brew "mmv"
# brew "mongosh"
# brew "mozjpeg"
# brew "node"
# brew "node-build"
# brew "nodenv"
brew "node@14"
brew "node@16"
brew "node@17"
brew "ocrmypdf"
# brew "openjdk"
brew "osxutils"
brew "parallel"
# brew "parallels"
brew "pdfcpu"
# brew "qt"
# brew "poppler"
brew "pdfgrep"
# brew "pdsh"
# brew "phpbrew"
brew "pinentry-mac"
# brew "platformio"
# brew "podman"
brew "pstree"
# brew "pulumi"
# brew "pup"
brew "pv" # progress
# brew "r"
brew "rename"
# brew "restic"
brew "rustup-init"
brew "sd" # search and replace
brew "telnet"
brew "terraform"
brew "tesseract-lang"
# brew "tippecanoe" # geo
brew "tree"
brew "up"
# brew "vegeta"
# brew "watch"
# brew "watchman"
brew "wellington" # sass
brew "wget"
# brew "woff2"
# brew "xh"
brew "xmlstarlet"
# brew "xsv"
brew "ydiff"
brew "youtube-dl"
# brew "filosottile/gomod/brew-gomod"
# brew "go-task/tap/go-task"
brew "mongodb/brew/mongodb-community"


cask "alfred"
cask "appcleaner"
# cask "audacity"
cask "arq"
# cask "balenaetcher"
# cask "base" # sqlite no arm
# cask "betterzip"
cask "bitbar"
# cask "blackhole"
cask "blender"
cask "brave-browser"
# cask "calibre" # no arm
# cask "charles" # no arm
# cask "clean-me"
# cask "coconutbattery"
cask "coolterm"
cask "cyberduck"
# cask "darktable"
# cask "dash"
# cask "dbeaver-community"
cask "docker"
# cask "epubquicklook" # no arm
cask "faxbot"
cask "figma"
# cask "findergo" # no arm
cask "firefox"
# cask "freecad" # no arm
# cask "google-chrome"
# cask "google-cloud-sdk"
# cask "google-earth-pro" # no arm
cask "handbrake"
cask "hex-fiend"
cask "iina"
# cask "imageoptim" # no arm
# cask "intellij-idea-ce"
# cask "java"
# cask "keepassxc"
cask "keepingyouawake"
cask "keycastr"
# cask "kicad"
# cask "kid3" # mp3 tagger
# cask "liteide"
cask "little-snitch"
# cask "ltspice"
cask "macdive"
# cask "macdown" # noarm https://github.com/gnattu/macdown/releases/tag/v0.8.0-as
# cask "meshmixer"
cask "moneymoney"
cask "netnewswire"
# cask "nheko" # matrix
cask "ocenaudio"
cask "omnidisksweeper"
# cask "onyx"
# cask "opencpn" # no arm
# cask "openscad" # no arm
# cask "oracle-jdk"
# cask "paw"
# cask "pdftotext" # discontinued
# cask "postgres"
cask "prusaslicer"
# cask "qgis"
cask "qlmarkdown"
cask "qlstephen" # plain text
cask "resilio-sync"
# cask "rowanj-gitx" # no arm https://github.com/gitx/gitx
# cask "rstudio"
cask "screenflow"
# cask "sequel-pro" # no arm
# cask "signal" # no arm
# cask "skype" # no arm
cask "spotify"
cask "sublime-text"
cask "superduper"
cask "suspicious-package"
cask "teamviewer"
cask "telegram"
cask "topnotch"
# cask "transmission-remote-gui"
# cask "vagrant" # no arm
# cask "virtualbox"
# cask "virtualbox-extension-pack"
cask "viscosity"
cask "visual-studio-code"
cask "vuescan"
# cask "whatsapp" # no arm

cask "font-lobster"
cask "font-poppins"
cask "font-dejavu-sans-mono-nerd-font"

# cask "pencil2d" # 2d
# cask "krita" # 2d
# cask "synfigstudio" # 2d

# davinci resolve https://www.blackmagicdesign.com/products/davinciresolve/
# sleep timer http://sleeptimerapp.com/